#pragma once

//=====================================================================================//
//                                 class LevelCaseInfo                                 //
//=====================================================================================//
struct LevelCaseInfo
{
	int m_weight;			///< Максимальный хранимый вес
	int m_respawn;			///< ??? Предположительно нигде не используется
	std::string m_setName;	///< Название набора предметов

	LevelCaseInfo()
	:	m_weight(0),
		m_respawn(0)
	{
	}
};