#pragma once

//=====================================================================================//
//                                   class TrainInfo                                   //
//=====================================================================================//
struct TrainInfo
{
	float m_stopFrame;		///< ¬рем€ в анимации, когда поезд должен остановитьс€
	//int m_turnsToGo;		///<  оличество ходов, сколько еще не будет поезда
	int m_turnsAtStation;	///<  оличество ходов просто€ на станции
	int m_turnsOutOfLevel;	///<  оличество кодов, которое поезд вне уровн€
	int m_jointToSwitch;	///< ѕор€дковый номер перехода на другой уровень, который активируетс€ поездом

	TrainInfo()
	:	m_stopFrame(0.0f),
		//m_turnsToGo(0),
		m_turnsAtStation(0),
		m_turnsOutOfLevel(0),
		m_jointToSwitch(0)
	{
	}
};