#pragma once

//=====================================================================================//
//                                   struct UseInfo                                    //
//=====================================================================================//
struct UseInfo
{
	std::string m_key;		///< Название ключа, без которого нельзя использовать
	std::string m_useHint;	///< Подсказка, выводящаяся на объекте
	int m_wisdom;			///< Интеллект, необходимый для использования
	int m_exp;				///< Опыт, который дают за использование

	UseInfo()
	:	m_wisdom(0),
		m_exp(0)
	{
	}
};