#pragma once

class BaseEntity;

//=====================================================================================//
//                                  class PanicPlayer                                  //
//=====================================================================================//
// механизм проигрывания паники существа
class PanicPlayer
{
public:
    /// Установить существо 
    static void Init(BaseEntity* entity);
    /// Произвести расчет (вызывать до false)
    static bool Execute();

	// Нужно ли установить режим отображения паники
	static bool CanExecute();
};