#include "Precomp.h"

//	Этот файл служит для хранения информации о текущей версии сейва
unsigned int g_SaveVersion = 22;

/******************************************************************
Версия 17				15 июля 2004

  - Добавлена информация об описаниях рандомных уровней
    
******************************************************************/

/******************************************************************
Версия 16				15 мая 2004

  - Добавлена информация об опыте всех героев и антигероев
    
******************************************************************/

/******************************************************************
Версия 10				17 марта 2004

  - Новое количество иконок на персонажей
    
******************************************************************/

/******************************************************************
Версия 7				21 ноября 2003

  - Сохранение режима крыш для уровня
    
******************************************************************/

/******************************************************************
Версия 7				21 ноября 2003

  - Новые скриптовые сцены
    
******************************************************************/

/******************************************************************
Версия 6				14 ноября 2003

  - Новый механизм видимости
    
******************************************************************/

/******************************************************************
Версия 5				3 августа 2003

  - Рефакторинг GameLevel
    
******************************************************************/

/******************************************************************
Версия 4				14 марта 2002

  - Исправил ошибку: забыл сделать сохранение энциклопедии сил ForceHandbook
    
******************************************************************/

/******************************************************************
Версия 3				12 марта 2002

  - переделано сохранение механизма порождения скриптовых сцен
    (интерфейс SSceneMgr)
    
******************************************************************/

/******************************************************************
Версия 2				11 марта 2002

  - сделано сохранение FastAccessStrategy для персонажей. 
  
******************************************************************/

/******************************************************************
Версия 1				06 марта 2002

  - В менеджер скриптовых сцен добавленно событие E_QUESTFINISH и
    соответсвенно код его обрабатывающий.

******************************************************************/
